Revit 2015 API
ModelPath.GetModelGUID Method
 A GUID identifying the Autodesk 360 model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
public Guid GetModelGUID()
Visual Basic
Public Function GetModelGUID As Guid
Visual C++
public:
Guid GetModelGUID()
See Also
ModelPath Class
Autodesk.Revit.DB Namespace